configuration/src/InformationRegisters/ЛичныеДела/ЛичныеДела.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЛичныеДела</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Данные</name>
    <type>
      <types>CatalogRef.Должности</types>
      <types>CatalogRef.Филиалы</types>
      <types>String</types>
      <types>Date</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаДобавления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Событие</name>
    <type>
      <types>EnumRef.СобытияПоЛичнымДелам</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/Enums/СобытияПоЛичнымДелам/СобытияПоЛичнымДелам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СобытияПоЛичнымДелам</name>
  <enumValues>
    <name>МестоРаботыРегл</name>
  </enumValues>
  <enumValues>
    <name>ПереведенВДругоеПодразделение</name>
  </enumValues>
  <enumValues>
    <name>ПереведенВКастомнуюКоманду</name>
  </enumValues>
  <enumValues>
    <name>ПереведенВКоманду</name>
  </enumValues>
  <enumValues>
    <name>ПринятНаДолжность</name>
  </enumValues>
  <enumValues>
    <name>Уволен</name>
  </enumValues>
</mdclass:Enum>

configuration/src/InformationRegisters/ЛичныеДела/RecordSetModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ЭтотОбъект.Количество() > 0 Тогда  
		
		Событие = ЭтотОбъект.Отбор.Событие.Значение; 
		
		Если Событие = Перечисления.СобытияПоЛичнымДелам.ПереведенВДругоеПодразделение 
			ИЛИ Событие = Перечисления.СобытияПоЛичнымДелам.ПринятНаДолжность Тогда 
			Сотрудник = ЭтотОбъект.Отбор.Сотрудник.Значение;
			Период = ЭтотОбъект.Отбор.Период.Значение;        
			РегистрыСведений.ОчередьСобытийНаОбработку.ДобавитьПроверкуДоступныхУслугФилиала(Сотрудник, Период);
		КонецЕсли;                             
	КонецЕсли;
	
КонецПроцедуры    

#КонецОбласти
